chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
#include "app_benchmark_script.h"

#include "amr_system.h"
#include "app_fault.h"
#include "app_lidar.h"
#include "bringup_log.h"
#include "chassis.h"
#include "stm32f4xx_hal.h"

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#define SCRIPT_OBSTACLE_STOP_MM 250U
#define SCRIPT_OBSTACLE_CLEAR_MM 450U
#define SCRIPT_LIDAR_STALE_MS 800U
#define SCRIPT_LOG_INTERVAL_MS 1000U
#define BENCH_FORWARD_LEFT_DUTY 498
#define BENCH_FORWARD_RIGHT_DUTY 500
#define AUTO_TURN_DUTY 420
#define AUTO_TURN_RIGHT_MS 550U
#define RETURN_AUTO_TURN_AROUND_MS 1900U
#define RETURN_AUTO_TURN_LEFT_MS 550U
#define AUTO_OBSTACLE_STOP_MM 360U
#define AUTO_OBSTACLE_CLEAR_MM 520U
#define ROUTE_MAX_TOKENS 64U
#define ROUTE_FORWARD_MS 900U
#define ROUTE_TURN_LEFT_MS 550U
#define ROUTE_TURN_RIGHT_MS 550U
#define ROUTE_WAIT_MS 200U
#define ROUTE_STOP_MS 200U
#define ROUTE_TEXT_MAX (ROUTE_MAX_TOKENS * 2U)
#define BENCH_FWD_MIN_MS 100U
#define BENCH_FWD_MAX_MS 3000U
#define BENCH_FWD_REJECT_FRONT_MM 250U

typedef enum
{
    ROUTE_SLOT_EXIT = 0,
    ROUTE_SLOT_RETURN
} ManualRouteSlot_t;

typedef struct
{
    ScriptAction action;
    int16_t duty;
    uint32_t duration_ms;
    const char *note;
} BenchmarkScriptStep_t;

typedef struct
{
    const char *name;
    const BenchmarkScriptStep_t *steps;
    uint8_t count;
} BenchmarkScriptDef_t;

static const BenchmarkScriptStep_t exit_script_steps[] = {
    {SCRIPT_ACT_FORWARD, 520, 900U, "exit forward 1"},
    {SCRIPT_ACT_TURN_RIGHT, 420, 550U, "exit right turn"},
    {SCRIPT_ACT_FORWARD, 520, 900U, "exit forward 2"},
    {SCRIPT_ACT_STOP, 0, 200U, "exit stop"},
};

static const BenchmarkScriptStep_t return_script_steps[] = {
    {SCRIPT_ACT_TURN_RIGHT, 420, 1750U, "return turn around"},
    {SCRIPT_ACT_FORWARD, 520, 900U, "return forward 1"},
    {SCRIPT_ACT_TURN_LEFT, 420, 550U, "return left turn"},
    {SCRIPT_ACT_FORWARD, 520, 900U, "return forward 2"},
    {SCRIPT_ACT_STOP, 0, 200U, "return stop"},
};

static const BenchmarkScriptDef_t exit_script = {
    "exit_script",
    exit_script_steps,
    (uint8_t)(sizeof(exit_script_steps) / sizeof(exit_script_steps[0])),
};

static const BenchmarkScriptDef_t return_script = {
    "return_script",
    return_script_steps,
    (uint8_t)(sizeof(return_script_steps) / sizeof(return_script_steps[0])),
};

static BenchmarkScriptStep_t route_exit_steps[ROUTE_MAX_TOKENS];
static BenchmarkScriptStep_t route_return_steps[ROUTE_MAX_TOKENS];
static BenchmarkScriptStep_t route_parse_steps[ROUTE_MAX_TOKENS];
static char route_exit_tokens[ROUTE_MAX_TOKENS];
static char route_return_tokens[ROUTE_MAX_TOKENS];
static char route_parse_tokens[ROUTE_MAX_TOKENS];
static BenchmarkScriptDef_t route_exit_script = {
    "route_exit",
    route_exit_steps,
    0U,
};
static BenchmarkScriptDef_t route_return_script = {
    "route_return",
    route_return_steps,
    0U,
};
static BenchmarkScriptStep_t bench_forward_steps[] = {
    {SCRIPT_ACT_FORWARD, BENCH_FORWARD_RIGHT_DUTY, ROUTE_FORWARD_MS, "bench forward"},
};
static BenchmarkScriptDef_t bench_forward_script = {
    "bench_fwd",
    bench_forward_steps,
    (uint8_t)(sizeof(bench_forward_steps) / sizeof(bench_forward_steps[0])),
};

static BenchmarkScriptState_t script_state = SCRIPT_IDLE;
static const BenchmarkScriptDef_t *script_current = NULL;
static uint8_t script_step_index = 0U;
static uint32_t script_step_start_ms = 0U;
static uint32_t script_wait_start_ms = 0U;
static uint32_t script_last_log_ms = 0U;
static uint8_t script_initialized = 0U;
static uint8_t script_step_active = 0U;
static uint8_t script_step_just_started = 0U;
static ScriptAction script_current_action = SCRIPT_ACT_STOP;
static uint8_t script_current_action_valid = 0U;
static uint32_t bench_forward_duration_ms = ROUTE_FORWARD_MS;
static uint32_t bench_forward_last_elapsed_ms = 0U;

static void AppBenchmarkScript_Start(const BenchmarkScriptDef_t *script);
static void AppBenchmarkScript_ClearRuntime(void);
static void AppBenchmarkScript_StartStep(uint32_t now_ms);
static void AppBenchmarkScript_ApplyAction(const BenchmarkScriptStep_t *step);
static void AppBenchmarkScript_FinishStep(uint32_t now_ms);
static void AppBenchmarkScript_ResumeCurrentStep(uint32_t now_ms);
static void AppBenchmarkScript_Abort(BenchmarkScriptState_t state, const char *reason);
static void AppBenchmarkScript_ApplyForwardTrim(void);
static void AppBenchmarkScript_CheckForwardSafety(uint32_t now_ms);
static void AppBenchmarkScript_UpdateWaitObstacleClear(uint32_t now_ms);
static void AppBenchmarkScript_UpdateAuto(uint32_t now_ms);
static void AppBenchmarkScript_UpdateAutoForward(uint32_t now_ms);
static void AppBenchmarkScript_UpdateAutoTurnRight(uint32_t now_ms);
static void AppBenchmarkScript_UpdateAutoWaitClear(uint32_t now_ms);
static void AppBenchmarkScript_UpdateReturnAuto(uint32_t now_ms);
static void AppBenchmarkScript_UpdateReturnAutoTurnAround(uint32_t now_ms);
static void AppBenchmarkScript_UpdateReturnAutoForward(uint32_t now_ms);
static void AppBenchmarkScript_UpdateReturnAutoTurnLeft(uint32_t now_ms);
static void AppBenchmarkScript_UpdateReturnAutoWaitClear(uint32_t now_ms);
static void AppBenchmarkScript_EnterAutoForward(uint32_t now_ms, const char *reason);
static void AppBenchmarkScript_EnterAutoTurnRight(uint32_t now_ms, uint32_t front_mm);
static void AppBenchmarkScript_EnterAutoWaitClear(uint32_t now_ms, const char *reason);
static void AppBenchmarkScript_EnterReturnAutoTurnAround(uint32_t now_ms, const char *reason);
static void AppBenchmarkScript_EnterReturnAutoForward(uint32_t now_ms, const char *reason);
static void AppBenchmarkScript_EnterReturnAutoTurnLeft(uint32_t now_ms, uint32_t front_mm);
static void AppBenchmarkScript_EnterReturnAutoWaitClear(uint32_t now_ms, const char *reason);
static uint8_t AppBenchmarkScript_SetRoute(ManualRouteSlot_t slot, const char *tokens);
static uint8_t AppBenchmarkScript_RouteTokenToStep(char token, BenchmarkScriptStep_t *step);
static uint8_t AppBenchmarkScript_IsRouteScript(const BenchmarkScriptDef_t *script);
static uint8_t AppBenchmarkScript_IsBenchScript(const BenchmarkScriptDef_t *script);
static char AppBenchmarkScript_CurrentRouteToken(void);
static void AppBenchmarkScript_FormatRouteTokens(const char *tokens,
                                                 uint8_t count,
                                                 char *buffer,
                                                 uint32_t buffer_len);
static uint8_t AppBenchmarkScript_BenchFrontSafeToStart(uint32_t now_ms);
static const BenchmarkScriptStep_t *AppBenchmarkScript_CurrentStep(void);
static uint32_t AppBenchmarkScript_ElapsedMs(uint32_t now_ms, uint32_t then_ms);
static bool AppBenchmarkScript_LidarFrontClear(uint32_t now_ms);
static bool AppBenchmarkScript_LidarFrontBlocked(uint32_t now_ms);
static bool AppBenchmarkScript_LidarFrontStale(uint32_t now_ms);
static bool AppBenchmarkScript_AutoFrontClear(uint32_t now_ms);
static bool AppBenchmarkScript_AutoFrontBlocked(uint32_t now_ms);
static bool AppBenchmarkScript_IsAutoState(BenchmarkScriptState_t state);
static bool AppBenchmarkScript_IsReturnAutoState(BenchmarkScriptState_t state);
static bool AppBenchmarkScript_IsActiveState(BenchmarkScriptState_t state);
static const char *AppBenchmarkScript_CurrentName(void);
static void AppBenchmarkScript_LogLowRate(uint32_t now_ms, const char *message);

void AppBenchmarkScript_Init(void)
{
    script_state = SCRIPT_IDLE;
    script_current = NULL;
    script_step_index = 0U;
    script_step_start_ms = 0U;
    script_wait_start_ms = 0U;
    script_last_log_ms = 0U;
    script_step_active = 0U;
    script_step_just_started = 0U;
    script_current_action = SCRIPT_ACT_STOP;
    script_current_action_valid = 0U;
    script_initialized = 1U;
    APP_LOG("SCRIPT: init obstacle_stop=%umm obstacle_clear=%umm lidar_stale=%ums",
            (unsigned int)SCRIPT_OBSTACLE_STOP_MM,
            (unsigned int)SCRIPT_OBSTACLE_CLEAR_MM,
            (unsigned int)SCRIPT_LIDAR_STALE_MS);
}

void AppBenchmarkScript_StartExit(void)
{
    AppBenchmarkScript_Start(&exit_script);
}

void AppBenchmarkScript_StartReturn(void)
{
    AppBenchmarkScript_Start(&return_script);
}

void AppBenchmarkScript_StartAuto(void)
{
    uint32_t now_ms;

    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        APP_LOG("SCRIPT: rejected reason=busy state=%s", AppBenchmarkScript_StateName(script_state));
        return;
    }

    AppBenchmarkScript_ClearRuntime();

    if (AMR_GetState() != AMR_STATE_IDLE)
    {
        APP_LOG("SCRIPT: auto rejected reason=amr_state state=%s", AMR_StateName(AMR_GetState()));
        return;
    }

    if (AppFault_IsActive())
    {
        APP_LOG("SCRIPT: auto rejected reason=fault fault=%s", AppFault_Name(AppFault_Get()));
        return;
    }

    script_current = NULL;
    script_step_index = 0U;
    now_ms = HAL_GetTick();
    APP_LOG("SCRIPT: auto start dutyL=%d dutyR=%d turn_duty=%d turn_ms=%u stop=%umm clear=%umm",
            (int)BENCH_FORWARD_LEFT_DUTY,
            (int)BENCH_FORWARD_RIGHT_DUTY,
            (int)AUTO_TURN_DUTY,
            (unsigned int)AUTO_TURN_RIGHT_MS,
            (unsigned int)AUTO_OBSTACLE_STOP_MM,
            (unsigned int)AUTO_OBSTACLE_CLEAR_MM);
    AppBenchmarkScript_EnterAutoForward(now_ms, "start");
}

void AppBenchmarkScript_StartReturnAuto(void)
{
    uint32_t now_ms;

    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        APP_LOG("SCRIPT: rejected reason=busy state=%s", AppBenchmarkScript_StateName(script_state));
        return;
    }

    AppBenchmarkScript_ClearRuntime();

    if (AMR_GetState() != AMR_STATE_IDLE)
    {
        APP_LOG("SCRIPT: return_auto rejected reason=amr_state state=%s", AMR_StateName(AMR_GetState()));
        return;
    }

    if (AppFault_IsActive())
    {
        APP_LOG("SCRIPT: return_auto rejected reason=fault fault=%s", AppFault_Name(AppFault_Get()));
        return;
    }

    script_current = NULL;
    script_step_index = 0U;
    now_ms = HAL_GetTick();
    APP_LOG("SCRIPT: return_auto start dutyL=%d dutyR=%d turn_duty=%d turnaround_ms=%u turn_left_ms=%u stop=%umm clear=%umm",
            (int)BENCH_FORWARD_LEFT_DUTY,
            (int)BENCH_FORWARD_RIGHT_DUTY,
            (int)AUTO_TURN_DUTY,
            (unsigned int)RETURN_AUTO_TURN_AROUND_MS,
            (unsigned int)RETURN_AUTO_TURN_LEFT_MS,
            (unsigned int)AUTO_OBSTACLE_STOP_MM,
            (unsigned int)AUTO_OBSTACLE_CLEAR_MM);
    AppBenchmarkScript_EnterReturnAutoTurnAround(now_ms, "start");
}

void AppBenchmarkScript_SetRouteExit(const char *tokens)
{
    (void)AppBenchmarkScript_SetRoute(ROUTE_SLOT_EXIT, tokens);
}

void AppBenchmarkScript_SetRouteReturn(const char *tokens)
{
    (void)AppBenchmarkScript_SetRoute(ROUTE_SLOT_RETURN, tokens);
}

void AppBenchmarkScript_StartRouteExit(void)
{
    if (route_exit_script.count == 0U)
    {
        APP_LOG("ROUTE: run_exit rejected reason=empty_route");
        return;
    }

