chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
    APP_LOG("ROUTE: run_exit count=%u", (unsigned int)route_exit_script.count);
    AppBenchmarkScript_Start(&route_exit_script);
}

void AppBenchmarkScript_StartRouteReturn(void)
{
    if (route_return_script.count == 0U)
    {
        APP_LOG("ROUTE: run_return rejected reason=empty_route");
        return;
    }

    APP_LOG("ROUTE: run_return count=%u", (unsigned int)route_return_script.count);
    AppBenchmarkScript_Start(&route_return_script);
}

void AppBenchmarkScript_PrintRouteStatus(void)
{
    char exit_text[ROUTE_TEXT_MAX];
    char return_text[ROUTE_TEXT_MAX];
    const BenchmarkScriptStep_t *step = AppBenchmarkScript_CurrentStep();
    uint32_t now_ms = HAL_GetTick();
    uint32_t elapsed_ms = 0U;
    uint32_t remaining_ms = 0U;
    uint8_t display_index = 0U;
    uint8_t total_count = 0U;
    char token = '-';
    const char *route_name = "none";
    const char *action_name = "NONE";

    AppBenchmarkScript_FormatRouteTokens(route_exit_tokens,
                                         route_exit_script.count,
                                         exit_text,
                                         (uint32_t)sizeof(exit_text));
    AppBenchmarkScript_FormatRouteTokens(route_return_tokens,
                                         route_return_script.count,
                                         return_text,
                                         (uint32_t)sizeof(return_text));

    if (AppBenchmarkScript_IsRouteScript(script_current) != 0U)
    {
        route_name = script_current->name;
        total_count = script_current->count;
        if (step != NULL)
        {
            display_index = (uint8_t)(script_step_index + 1U);
            token = AppBenchmarkScript_CurrentRouteToken();
            if (script_current_action_valid != 0U)
            {
                action_name = AppBenchmarkScript_ActionName(script_current_action);
            }

            if (script_step_active != 0U)
            {
                elapsed_ms = AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms);
            }

            remaining_ms = (elapsed_ms < step->duration_ms) ? (step->duration_ms - elapsed_ms) : 0U;
        }
        else
        {
            display_index = total_count;
        }
    }

    APP_LOG("ROUTE: exit count=%u tokens=%s",
            (unsigned int)route_exit_script.count,
            exit_text);
    APP_LOG("ROUTE: return count=%u tokens=%s",
            (unsigned int)route_return_script.count,
            return_text);
    APP_LOG("ROUTE: status state=%s route=%s index=%u/%u token=%c action=%s elapsed=%lums remaining=%lums",
            AppBenchmarkScript_StateName(script_state),
            route_name,
            (unsigned int)display_index,
            (unsigned int)total_count,
            token,
            action_name,
            (unsigned long)elapsed_ms,
            (unsigned long)remaining_ms);
}

void AppBenchmarkScript_ClearRoutes(void)
{
    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        APP_LOG("ROUTE: clear rejected reason=busy state=%s", AppBenchmarkScript_StateName(script_state));
        return;
    }

    route_exit_script.count = 0U;
    route_return_script.count = 0U;
    memset(route_exit_tokens, 0, sizeof(route_exit_tokens));
    memset(route_return_tokens, 0, sizeof(route_return_tokens));
    if (AppBenchmarkScript_IsRouteScript(script_current) != 0U)
    {
        script_current = NULL;
        script_step_index = 0U;
        script_state = SCRIPT_IDLE;
        AppBenchmarkScript_ClearRuntime();
    }

    APP_LOG("ROUTE: cleared max_tokens=%u", (unsigned int)ROUTE_MAX_TOKENS);
}

void AppBenchmarkScript_StartBenchForward(uint32_t duration_ms)
{
    uint32_t now_ms;

    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if ((duration_ms < BENCH_FWD_MIN_MS) || (duration_ms > BENCH_FWD_MAX_MS))
    {
        APP_LOG("BENCH: fwd rejected reason=duration_range duration=%lums min=%u max=%u",
                (unsigned long)duration_ms,
                (unsigned int)BENCH_FWD_MIN_MS,
                (unsigned int)BENCH_FWD_MAX_MS);
        return;
    }

    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        APP_LOG("BENCH: fwd rejected reason=busy state=%s", AppBenchmarkScript_StateName(script_state));
        return;
    }

    if (AMR_GetState() != AMR_STATE_IDLE)
    {
        APP_LOG("BENCH: fwd rejected reason=amr_state state=%s", AMR_StateName(AMR_GetState()));
        return;
    }

    if (AppFault_IsActive())
    {
        APP_LOG("BENCH: fwd rejected reason=fault fault=%s", AppFault_Name(AppFault_Get()));
        return;
    }

    now_ms = HAL_GetTick();
    if (AppBenchmarkScript_BenchFrontSafeToStart(now_ms) == 0U)
    {
        return;
    }

    bench_forward_duration_ms = duration_ms;
    bench_forward_last_elapsed_ms = 0U;
    bench_forward_steps[0].duration_ms = duration_ms;
    APP_LOG("BENCH: fwd start duration=%lums dutyL=%d dutyR=%d front_reject=%umm",
            (unsigned long)duration_ms,
            (int)BENCH_FORWARD_LEFT_DUTY,
            (int)BENCH_FORWARD_RIGHT_DUTY,
            (unsigned int)BENCH_FWD_REJECT_FRONT_MM);
    AppBenchmarkScript_Start(&bench_forward_script);
}

void AppBenchmarkScript_PrintBenchStatus(void)
{
    const BenchmarkScriptStep_t *step = AppBenchmarkScript_CurrentStep();
    uint32_t now_ms = HAL_GetTick();
    uint32_t elapsed_ms = 0U;
    uint32_t remaining_ms = 0U;

    if (AppBenchmarkScript_IsBenchScript(script_current) != 0U)
    {
        if (step != NULL)
        {
            if (script_step_active != 0U)
            {
                elapsed_ms = AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms);
            }

            remaining_ms = (elapsed_ms < bench_forward_duration_ms) ? (bench_forward_duration_ms - elapsed_ms) : 0U;
        }
        else if (script_state == SCRIPT_DONE)
        {
            elapsed_ms = bench_forward_last_elapsed_ms;
        }
    }

    APP_LOG("BENCH: status state=%s duration=%lums elapsed=%lums remaining=%lums",
            AppBenchmarkScript_StateName(script_state),
            (unsigned long)bench_forward_duration_ms,
            (unsigned long)elapsed_ms,
            (unsigned long)remaining_ms);
}

void AppBenchmarkScript_Stop(const char *reason)
{
    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        Chassis_Stop();
        script_state = SCRIPT_ABORTED;
        AppBenchmarkScript_ClearRuntime();
        APP_LOG("SCRIPT: stopped reason=%s", (reason != NULL) ? reason : "unspecified");
    }
}

