chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
void AppBenchmarkScript_Reset(void)
{
    Chassis_Stop();
    script_state = SCRIPT_IDLE;
    script_current = NULL;
    script_step_index = 0U;
    AppBenchmarkScript_ClearRuntime();
    script_initialized = 1U;
    APP_LOG("SCRIPT: reset");
}

void AppBenchmarkScript_Update(void)
{
    uint32_t now_ms;
    const BenchmarkScriptStep_t *step;

    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if (!AppBenchmarkScript_IsActiveState(script_state))
    {
        return;
    }

    now_ms = HAL_GetTick();

    if (AppFault_IsActive() || (AMR_GetState() == AMR_STATE_ESTOP) || (AMR_GetState() == AMR_STATE_FAULT))
    {
        AppBenchmarkScript_Abort(SCRIPT_FAULT, "fault_or_estop");
        return;
    }

    if (AppBenchmarkScript_IsAutoState(script_state))
    {
        AppBenchmarkScript_UpdateAuto(now_ms);
        return;
    }

    if (AppBenchmarkScript_IsReturnAutoState(script_state))
    {
        AppBenchmarkScript_UpdateReturnAuto(now_ms);
        return;
    }

    if (script_state == SCRIPT_WAIT_OBSTACLE_CLEAR)
    {
        AppBenchmarkScript_UpdateWaitObstacleClear(now_ms);
        return;
    }

    step = AppBenchmarkScript_CurrentStep();
    if (step == NULL)
    {
        script_state = SCRIPT_DONE;
        Chassis_Stop();
        AppBenchmarkScript_ClearRuntime();
        APP_LOG("SCRIPT: done %s", (script_current != NULL) ? script_current->name : "none");
        return;
    }

    if (script_step_active == 0U)
    {
        return;
    }

    if (step->action == SCRIPT_ACT_FORWARD)
    {
        AppBenchmarkScript_CheckForwardSafety(now_ms);
        if (script_state != SCRIPT_RUNNING)
        {
            return;
        }
    }

    if (script_step_just_started != 0U)
    {
        script_step_just_started = 0U;
        return;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms) >= step->duration_ms)
    {
        AppBenchmarkScript_FinishStep(now_ms);
    }
}

void AppBenchmarkScript_PrintStatus(void)
{
    const BenchmarkScriptStep_t *step = AppBenchmarkScript_CurrentStep();
    uint8_t show_step = 0U;
    uint32_t now_ms = HAL_GetTick();
    uint32_t elapsed_ms = 0U;
    uint32_t remaining_ms = 0U;
    uint8_t display_step_index = 0U;
    const char *action_name = "NONE";
    const char *script_name = AppBenchmarkScript_CurrentName();

    if (((script_state == SCRIPT_RUNNING) || (script_state == SCRIPT_WAIT_OBSTACLE_CLEAR)) &&
        (step != NULL) &&
        (script_current_action_valid != 0U))
    {
        show_step = 1U;
        action_name = AppBenchmarkScript_ActionName(script_current_action);
        display_step_index = (uint8_t)(script_step_index + 1U);
    }
    else if ((AppBenchmarkScript_IsAutoState(script_state) ||
              AppBenchmarkScript_IsReturnAutoState(script_state)) &&
             (script_current_action_valid != 0U))
    {
        show_step = 1U;
        action_name = AppBenchmarkScript_ActionName(script_current_action);
    }
    else if ((script_state == SCRIPT_DONE) && (script_current != NULL))
    {
        display_step_index = script_current->count;
    }

    if ((show_step != 0U) && (script_step_active != 0U))
    {
        elapsed_ms = AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms);
    }

    if ((show_step != 0U) && (step != NULL))
    {
        remaining_ms = (elapsed_ms < step->duration_ms) ? (step->duration_ms - elapsed_ms) : 0U;
    }
    else if (script_state == SCRIPT_AUTO_TURN_RIGHT)
    {
        remaining_ms = (elapsed_ms < AUTO_TURN_RIGHT_MS) ? (AUTO_TURN_RIGHT_MS - elapsed_ms) : 0U;
    }
    else if (script_state == SCRIPT_RETURN_AUTO_TURN_AROUND)
    {
        remaining_ms = (elapsed_ms < RETURN_AUTO_TURN_AROUND_MS) ? (RETURN_AUTO_TURN_AROUND_MS - elapsed_ms) : 0U;
    }
    else if (script_state == SCRIPT_RETURN_AUTO_TURN_LEFT)
    {
        remaining_ms = (elapsed_ms < RETURN_AUTO_TURN_LEFT_MS) ? (RETURN_AUTO_TURN_LEFT_MS - elapsed_ms) : 0U;
    }

    APP_LOG("SCRIPT: status state=%s name=%s step=%u/%u action=%s elapsed=%lums remaining=%lums",
            AppBenchmarkScript_StateName(script_state),
            script_name,
            (unsigned int)display_step_index,
            (unsigned int)((script_current != NULL) ? script_current->count : 0U),
            action_name,
            (unsigned long)elapsed_ms,
            (unsigned long)remaining_ms);
}

uint8_t AppBenchmarkScript_IsActive(void)
{
    return AppBenchmarkScript_IsActiveState(script_state) ? 1U : 0U;
}

uint8_t AppBenchmarkScript_IsAutoActive(void)
{
    return AppBenchmarkScript_IsAutoState(script_state) ? 1U : 0U;
}

uint8_t AppBenchmarkScript_IsReturnActive(void)
{
    return (AppBenchmarkScript_IsActiveState(script_state) &&
            (script_current == &return_script)) ? 1U : 0U;
}

uint8_t AppBenchmarkScript_IsReturnAutoActive(void)
{
    return AppBenchmarkScript_IsReturnAutoState(script_state) ? 1U : 0U;
}

BenchmarkScriptState_t AppBenchmarkScript_GetState(void)
{
    return script_state;
}

const char *AppBenchmarkScript_StateName(BenchmarkScriptState_t state)
{
    switch (state)
    {
        case SCRIPT_IDLE:
            return "IDLE";
        case SCRIPT_RUNNING:
            return "RUNNING";
        case SCRIPT_WAIT_OBSTACLE_CLEAR:
            return "WAIT_OBSTACLE_CLEAR";
        case SCRIPT_AUTO_FORWARD:
            return "SCRIPT_AUTO_FORWARD";
        case SCRIPT_AUTO_TURN_RIGHT:
            return "SCRIPT_AUTO_TURN_RIGHT";
        case SCRIPT_AUTO_WAIT_CLEAR:
            return "SCRIPT_AUTO_WAIT_CLEAR";
        case SCRIPT_RETURN_AUTO_TURN_AROUND:
            return "SCRIPT_RETURN_AUTO_TURN_AROUND";
        case SCRIPT_RETURN_AUTO_FORWARD:
            return "SCRIPT_RETURN_AUTO_FORWARD";
        case SCRIPT_RETURN_AUTO_TURN_LEFT:
            return "SCRIPT_RETURN_AUTO_TURN_LEFT";
        case SCRIPT_RETURN_AUTO_WAIT_CLEAR:
            return "SCRIPT_RETURN_AUTO_WAIT_CLEAR";
        case SCRIPT_DONE:
            return "DONE";
        case SCRIPT_ABORTED:
            return "ABORTED";
        case SCRIPT_FAULT:
            return "FAULT";
        default:
            return "UNKNOWN";
    }
}

