chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
const char *AppBenchmarkScript_ActionName(ScriptAction action)
{
    switch (action)
    {
        case SCRIPT_ACT_STOP:
            return "STOP";
        case SCRIPT_ACT_WAIT:
            return "WAIT";
        case SCRIPT_ACT_FORWARD:
            return "FORWARD";
        case SCRIPT_ACT_BACKUP:
            return "BACKUP";
        case SCRIPT_ACT_TURN_LEFT:
            return "TURN_LEFT";
        case SCRIPT_ACT_TURN_RIGHT:
            return "TURN_RIGHT";
        case SCRIPT_ACT_TURN_AROUND:
            return "TURN_AROUND";
        default:
            return "UNKNOWN";
    }
}

static void AppBenchmarkScript_Start(const BenchmarkScriptDef_t *script)
{
    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if (script == NULL)
    {
        APP_LOG("SCRIPT: rejected reason=no_script");
        return;
    }

    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        APP_LOG("SCRIPT: rejected reason=busy state=%s", AppBenchmarkScript_StateName(script_state));
        return;
    }

    AppBenchmarkScript_ClearRuntime();

    if (AMR_GetState() != AMR_STATE_IDLE)
    {
        APP_LOG("SCRIPT: rejected reason=amr_state state=%s", AMR_StateName(AMR_GetState()));
        return;
    }

    if (AppFault_IsActive())
    {
        APP_LOG("SCRIPT: rejected reason=fault fault=%s", AppFault_Name(AppFault_Get()));
        return;
    }

    script_current = script;
    script_step_index = 0U;
    script_state = SCRIPT_RUNNING;
    APP_LOG("SCRIPT: start %s count=%u", script->name, (unsigned int)script->count);
    AppBenchmarkScript_StartStep(0U);
}

static void AppBenchmarkScript_ClearRuntime(void)
{
    script_step_active = 0U;
    script_step_just_started = 0U;
    script_step_start_ms = 0U;
    script_wait_start_ms = 0U;
    script_last_log_ms = 0U;
    script_current_action = SCRIPT_ACT_STOP;
    script_current_action_valid = 0U;
}

static void AppBenchmarkScript_StartStep(uint32_t now_ms)
{
    const BenchmarkScriptStep_t *step = AppBenchmarkScript_CurrentStep();
    uint32_t start_ms = (now_ms != 0U) ? now_ms : HAL_GetTick();

    if (step == NULL)
    {
        script_state = SCRIPT_DONE;
        Chassis_Stop();
        AppBenchmarkScript_ClearRuntime();
        APP_LOG("SCRIPT: done %s", (script_current != NULL) ? script_current->name : "none");
        return;
    }

    script_step_start_ms = start_ms;
    script_step_active = 1U;
    script_step_just_started = 1U;
    script_current_action = step->action;
    script_current_action_valid = 1U;
    if (step->action == SCRIPT_ACT_FORWARD)
    {
        APP_LOG("SCRIPT: step=%u/%u action=%s duty=%d dutyL=%d dutyR=%d dur=%lums note=%s",
                (unsigned int)(script_step_index + 1U),
                (unsigned int)((script_current != NULL) ? script_current->count : 0U),
                AppBenchmarkScript_ActionName(step->action),
                (int)step->duty,
                (int)BENCH_FORWARD_LEFT_DUTY,
                (int)BENCH_FORWARD_RIGHT_DUTY,
                (unsigned long)step->duration_ms,
                (step->note != NULL) ? step->note : "");
    }
    else
    {
        APP_LOG("SCRIPT: step=%u/%u action=%s duty=%d dur=%lums note=%s",
                (unsigned int)(script_step_index + 1U),
                (unsigned int)((script_current != NULL) ? script_current->count : 0U),
                AppBenchmarkScript_ActionName(step->action),
                (int)step->duty,
                (unsigned long)step->duration_ms,
                (step->note != NULL) ? step->note : "");
    }
    if (step->action == SCRIPT_ACT_FORWARD)
    {
        AppBenchmarkScript_CheckForwardSafety(start_ms);
        if (script_state != SCRIPT_RUNNING)
        {
            script_current_action = step->action;
            script_current_action_valid = 1U;
            return;
        }
    }

    AppBenchmarkScript_ApplyAction(step);
}

static void AppBenchmarkScript_ApplyAction(const BenchmarkScriptStep_t *step)
{
    if (step == NULL)
    {
        Chassis_Stop();
        return;
    }

    switch (step->action)
    {
        case SCRIPT_ACT_STOP:
        case SCRIPT_ACT_WAIT:
            Chassis_Stop();
            break;

        case SCRIPT_ACT_FORWARD:
            AppBenchmarkScript_ApplyForwardTrim();
            break;

        case SCRIPT_ACT_BACKUP:
            Chassis_Backward(step->duty);
            break;

        case SCRIPT_ACT_TURN_LEFT:
            Chassis_TurnLeft(step->duty);
            break;

        case SCRIPT_ACT_TURN_RIGHT:
            Chassis_TurnRight(step->duty);
            break;

        case SCRIPT_ACT_TURN_AROUND:
            Chassis_TurnRight(step->duty);
            break;

        default:
            Chassis_Stop();
            break;
    }
}

static void AppBenchmarkScript_ApplyForwardTrim(void)
{
    Chassis_SetRaw(BENCH_FORWARD_LEFT_DUTY, BENCH_FORWARD_RIGHT_DUTY);
}

static void AppBenchmarkScript_FinishStep(uint32_t now_ms)
{
    uint32_t elapsed_ms = AppBenchmarkScript_ElapsedMs(now_ms, script_step_start_ms);

    if ((script_step_active == 0U) || (script_current == NULL) || (script_step_index >= script_current->count))
    {
        return;
    }

    APP_LOG("SCRIPT: step=%u/%u done elapsed=%lums",
            (unsigned int)(script_step_index + 1U),
            (unsigned int)((script_current != NULL) ? script_current->count : 0U),
            (unsigned long)elapsed_ms);

    if (AppBenchmarkScript_IsBenchScript(script_current) != 0U)
    {
        bench_forward_last_elapsed_ms = elapsed_ms;
    }

    script_step_index++;
    if ((script_current == NULL) || (script_step_index >= script_current->count))
    {
        script_state = SCRIPT_DONE;
        Chassis_Stop();
        AppBenchmarkScript_ClearRuntime();
        APP_LOG("SCRIPT: done %s", (script_current != NULL) ? script_current->name : "none");
        return;
    }

    AppBenchmarkScript_ClearRuntime();
    AppBenchmarkScript_StartStep(now_ms);
}

static void AppBenchmarkScript_ResumeCurrentStep(uint32_t now_ms)
{
    const BenchmarkScriptStep_t *step = AppBenchmarkScript_CurrentStep();

