chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
static void AppBenchmarkScript_EnterAutoTurnRight(uint32_t now_ms, uint32_t front_mm)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_AUTO_TURN_RIGHT;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_TURN_RIGHT;
    script_current_action_valid = 1U;
    Chassis_TurnRight(AUTO_TURN_DUTY);
    APP_LOG("SCRIPT: auto state=TURN_RIGHT duty=%d dur=%ums front=%u stop=%u",
            (int)AUTO_TURN_DUTY,
            (unsigned int)AUTO_TURN_RIGHT_MS,
            (unsigned int)front_mm,
            (unsigned int)AUTO_OBSTACLE_STOP_MM);
}

static void AppBenchmarkScript_EnterAutoWaitClear(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_AUTO_WAIT_CLEAR;
    script_step_start_ms = now_ms;
    script_wait_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_current_action = SCRIPT_ACT_WAIT;
    script_current_action_valid = 1U;
    Chassis_Stop();
    APP_LOG("SCRIPT: auto state=WAIT_CLEAR reason=%s clear=%u",
            (reason != NULL) ? reason : "none",
            (unsigned int)AUTO_OBSTACLE_CLEAR_MM);
}

static void AppBenchmarkScript_EnterReturnAutoTurnAround(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_TURN_AROUND;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_TURN_RIGHT;
    script_current_action_valid = 1U;
    Chassis_TurnRight(AUTO_TURN_DUTY);
    APP_LOG("SCRIPT: return_auto state=TURN_AROUND duty=%d dur=%ums reason=%s",
            (int)AUTO_TURN_DUTY,
            (unsigned int)RETURN_AUTO_TURN_AROUND_MS,
            (reason != NULL) ? reason : "none");
}

static void AppBenchmarkScript_EnterReturnAutoForward(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_FORWARD;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_FORWARD;
    script_current_action_valid = 1U;
    AppBenchmarkScript_ApplyForwardTrim();
    APP_LOG("SCRIPT: return_auto state=FORWARD dutyL=%d dutyR=%d reason=%s",
            (int)BENCH_FORWARD_LEFT_DUTY,
            (int)BENCH_FORWARD_RIGHT_DUTY,
            (reason != NULL) ? reason : "none");
    AppBenchmarkScript_UpdateReturnAutoForward(now_ms);
}

static void AppBenchmarkScript_EnterReturnAutoTurnLeft(uint32_t now_ms, uint32_t front_mm)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_TURN_LEFT;
    script_step_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_wait_start_ms = 0U;
    script_current_action = SCRIPT_ACT_TURN_LEFT;
    script_current_action_valid = 1U;
    Chassis_TurnLeft(AUTO_TURN_DUTY);
    APP_LOG("SCRIPT: return_auto state=TURN_LEFT duty=%d dur=%ums front=%u stop=%u",
            (int)AUTO_TURN_DUTY,
            (unsigned int)RETURN_AUTO_TURN_LEFT_MS,
            (unsigned int)front_mm,
            (unsigned int)AUTO_OBSTACLE_STOP_MM);
}

static void AppBenchmarkScript_EnterReturnAutoWaitClear(uint32_t now_ms, const char *reason)
{
    script_current = NULL;
    script_step_index = 0U;
    script_state = SCRIPT_RETURN_AUTO_WAIT_CLEAR;
    script_step_start_ms = now_ms;
    script_wait_start_ms = now_ms;
    script_step_active = 1U;
    script_step_just_started = 0U;
    script_current_action = SCRIPT_ACT_WAIT;
    script_current_action_valid = 1U;
    Chassis_Stop();
    APP_LOG("SCRIPT: return_auto state=WAIT_CLEAR reason=%s clear=%u",
            (reason != NULL) ? reason : "none",
            (unsigned int)AUTO_OBSTACLE_CLEAR_MM);
}

static uint8_t AppBenchmarkScript_SetRoute(ManualRouteSlot_t slot, const char *tokens)
{
    uint8_t parsed_count = 0U;
    const char *cursor = tokens;
    BenchmarkScriptStep_t *target_steps;
    char *target_tokens;
    BenchmarkScriptDef_t *target_script;
    const char *target_name;

    if (script_initialized == 0U)
    {
        AppBenchmarkScript_Init();
    }

    if (AppBenchmarkScript_IsActiveState(script_state))
    {
        APP_LOG("ROUTE: set rejected reason=busy state=%s", AppBenchmarkScript_StateName(script_state));
        return 0U;
    }

    if ((tokens == NULL) || (tokens[0] == '\0'))
    {
        APP_LOG("ROUTE: set rejected reason=empty_tokens");
        return 0U;
    }

    while ((cursor != NULL) && (*cursor != '\0'))
    {
        char ch = *cursor;

        if ((ch == ' ') || (ch == ','))
        {
            cursor++;
            continue;
        }

        if ((ch >= 'A') && (ch <= 'Z'))
        {
            ch = (char)(ch + ('a' - 'A'));
        }

        if (parsed_count >= ROUTE_MAX_TOKENS)
        {
            APP_LOG("ROUTE: set rejected reason=too_many_tokens max=%u",
                    (unsigned int)ROUTE_MAX_TOKENS);
            return 0U;
        }

        if (AppBenchmarkScript_RouteTokenToStep(ch, &route_parse_steps[parsed_count]) == 0U)
        {
            APP_LOG("ROUTE: set rejected reason=bad_token token=%c valid=F,L,R,U,W,S", ch);
            return 0U;
        }

        route_parse_tokens[parsed_count] = ch;
        parsed_count++;
        cursor++;
    }

    if (parsed_count == 0U)
    {
        APP_LOG("ROUTE: set rejected reason=empty_tokens");
        return 0U;
    }

    if (slot == ROUTE_SLOT_RETURN)
    {
        target_steps = route_return_steps;
        target_tokens = route_return_tokens;
        target_script = &route_return_script;
        target_name = "return";
    }
    else
    {
        target_steps = route_exit_steps;
        target_tokens = route_exit_tokens;
        target_script = &route_exit_script;
        target_name = "exit";
    }

    memcpy(target_steps, route_parse_steps, (size_t)parsed_count * sizeof(route_parse_steps[0]));
    memcpy(target_tokens, route_parse_tokens, (size_t)parsed_count * sizeof(route_parse_tokens[0]));
    if (parsed_count < ROUTE_MAX_TOKENS)
    {
        memset(&target_tokens[parsed_count], 0, (size_t)(ROUTE_MAX_TOKENS - parsed_count));
    }

    target_script->count = parsed_count;

    APP_LOG("ROUTE: set_%s count=%u max=%u F=%ums L=%ums R=%ums U=%ums turn_duty=%d stop=%ums",
            target_name,
            (unsigned int)parsed_count,
            (unsigned int)ROUTE_MAX_TOKENS,
            (unsigned int)ROUTE_FORWARD_MS,
            (unsigned int)ROUTE_TURN_LEFT_MS,
            (unsigned int)ROUTE_TURN_RIGHT_MS,
            (unsigned int)RETURN_AUTO_TURN_AROUND_MS,
            (int)AUTO_TURN_DUTY,
            (unsigned int)ROUTE_STOP_MS);
    return 1U;
}

