chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_benchmark_script.c
static uint8_t AppBenchmarkScript_RouteTokenToStep(char token, BenchmarkScriptStep_t *step)
{
    char normalized = token;

    if (step == NULL)
    {
        return 0U;
    }

    if ((normalized >= 'A') && (normalized <= 'Z'))
    {
        normalized = (char)(normalized + ('a' - 'A'));
    }

    switch (normalized)
    {
        case 'f':
            step->action = SCRIPT_ACT_FORWARD;
            step->duty = BENCH_FORWARD_RIGHT_DUTY;
            step->duration_ms = ROUTE_FORWARD_MS;
            step->note = "manual route forward";
            return 1U;

        case 'l':
            step->action = SCRIPT_ACT_TURN_LEFT;
            step->duty = AUTO_TURN_DUTY;
            step->duration_ms = ROUTE_TURN_LEFT_MS;
            step->note = "manual route left";
            return 1U;

        case 'r':
            step->action = SCRIPT_ACT_TURN_RIGHT;
            step->duty = AUTO_TURN_DUTY;
            step->duration_ms = ROUTE_TURN_RIGHT_MS;
            step->note = "manual route right";
            return 1U;

        case 'u':
            step->action = SCRIPT_ACT_TURN_AROUND;
            step->duty = AUTO_TURN_DUTY;
            step->duration_ms = RETURN_AUTO_TURN_AROUND_MS;
            step->note = "manual route turnaround";
            return 1U;

        case 'w':
            step->action = SCRIPT_ACT_WAIT;
            step->duty = 0;
            step->duration_ms = ROUTE_WAIT_MS;
            step->note = "manual route wait";
            return 1U;

        case 's':
            step->action = SCRIPT_ACT_STOP;
            step->duty = 0;
            step->duration_ms = ROUTE_STOP_MS;
            step->note = "manual route stop";
            return 1U;

        default:
            return 0U;
    }
}

static uint8_t AppBenchmarkScript_IsRouteScript(const BenchmarkScriptDef_t *script)
{
    return ((script == &route_exit_script) || (script == &route_return_script)) ? 1U : 0U;
}

static uint8_t AppBenchmarkScript_IsBenchScript(const BenchmarkScriptDef_t *script)
{
    return (script == &bench_forward_script) ? 1U : 0U;
}

static char AppBenchmarkScript_CurrentRouteToken(void)
{
    if (script_current == &route_exit_script)
    {
        return (script_step_index < route_exit_script.count) ? (char)(route_exit_tokens[script_step_index] - ('a' - 'A')) : '-';
    }

    if (script_current == &route_return_script)
    {
        return (script_step_index < route_return_script.count) ? (char)(route_return_tokens[script_step_index] - ('a' - 'A')) : '-';
    }

    return '-';
}

static void AppBenchmarkScript_FormatRouteTokens(const char *tokens,
                                                 uint8_t count,
                                                 char *buffer,
                                                 uint32_t buffer_len)
{
    uint32_t pos = 0U;
    uint8_t i;

    if ((buffer == NULL) || (buffer_len == 0U))
    {
        return;
    }

    if ((tokens == NULL) || (count == 0U))
    {
        (void)snprintf(buffer, buffer_len, "(empty)");
        return;
    }

    for (i = 0U; i < count; i++)
    {
        char token = (char)(tokens[i] - ('a' - 'A'));

        if ((i != 0U) && (pos < (buffer_len - 1U)))
        {
            buffer[pos] = ',';
            pos++;
        }

        if (pos < (buffer_len - 1U))
        {
            buffer[pos] = token;
            pos++;
        }
    }

    buffer[pos] = '\0';
}

static uint8_t AppBenchmarkScript_BenchFrontSafeToStart(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if (AppBenchmarkScript_LidarFrontStale(now_ms))
    {
        APP_LOG("BENCH: fwd rejected reason=lidar_invalid_or_stale");
        return 0U;
    }

    if ((lidar != NULL) && (lidar->front_valid != 0U) && (lidar->front_min_mm < BENCH_FWD_REJECT_FRONT_MM))
    {
        APP_LOG("BENCH: fwd rejected reason=front_too_close front=%u min=%u",
                (unsigned int)lidar->front_min_mm,
                (unsigned int)BENCH_FWD_REJECT_FRONT_MM);
        return 0U;
    }

    return 1U;
}

static const BenchmarkScriptStep_t *AppBenchmarkScript_CurrentStep(void)
{
    if ((script_current == NULL) || (script_step_index >= script_current->count))
    {
        return NULL;
    }

    return &script_current->steps[script_step_index];
}

static uint32_t AppBenchmarkScript_ElapsedMs(uint32_t now_ms, uint32_t then_ms)
{
    if (now_ms >= then_ms)
    {
        return now_ms - then_ms;
    }

    return 0U;
}

static bool AppBenchmarkScript_LidarFrontClear(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm > SCRIPT_OBSTACLE_CLEAR_MM);
}

static bool AppBenchmarkScript_LidarFrontBlocked(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm < SCRIPT_OBSTACLE_STOP_MM);
}

static bool AppBenchmarkScript_LidarFrontStale(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return true;
    }

    return (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS);
}

static bool AppBenchmarkScript_AutoFrontClear(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

    if ((lidar == NULL) || (lidar->front_valid == 0U))
    {
        return false;
    }

    if (AppBenchmarkScript_ElapsedMs(now_ms, lidar->last_valid_update_ms) > SCRIPT_LIDAR_STALE_MS)
    {
        return false;
    }

    return (lidar->front_min_mm > AUTO_OBSTACLE_CLEAR_MM);
}

static bool AppBenchmarkScript_AutoFrontBlocked(uint32_t now_ms)
{
    const AppLidarStatus *lidar = App_Lidar_GetStatus();

